{
    "Domain-1": {
        "overview": "This domain assesses an organisation's ultimate control over its data, independent of external jurisdictions or political influences. It goes beyond basic data residency by focusing on legal control, access, and encryption management. Maturity here confirms that data location is actively governed by the organisation's legal and business requirements, rather than dictated solely by a cloud provider or foreign law. Achieving high maturity ensures the organisation can unilaterally secure, access, and move its data while remaining compliant with domestic regulations, particularly regarding cross-border transfers and governmental data access requests.",
        "qnum": "1",
        "title": "Data Sovereignty",
        "1": "Data Residency & Location",
        "1-summary": "Defines and enforces where data is physically stored based on legal and business requirements.",
        "1-tier": "Foundation",
        "1-points": "1",
        "1-recommendation": "<h2 class='why-what'>Executive </h2><p>Establish a formal <b>Data Residency Policy</b> that clearly mandates the specific geographic and jurisdictional locations for data storage based on its classification and corresponding legal requirements. This policy must be integrated into all vendor procurement rules, and senior management must mandate an annual audit of all cloud provider contracts to verify full compliance with these residency requirements, including detailed logging of data movement.</p><h2 class='why-what'>Technical</h2><p>Utilise <b>Sovereign Cloud regions</b> or private, hybrid cloud infrastructure where the physical location of the data centers is certified and auditable within the required jurisdiction. Implement technical controls like <b>geo-fencing</b> and <b>data-at-rest encryption</b> with keys managed separately to prevent accidental or unauthorised data movement outside designated zones, irrespective of the service provider's global footprint.</p>"        ,
        "2": "Data Protection & Privacy",
        "2-summary": "Basic compliance with common data protection and privacy regulations.",
        "2-tier": "Foundation",
        "2-points": "2",
        "2-recommendation": "<h2 class='why-what'>Executive </h2><p>Integrate <b>Privacy-by-Design</b> and <b>Security-by-Design</b> principles into the architecture review board for all new digital initiatives, ensuring privacy requirements are met from the inception of a project. Senior leaders must allocate dedicated budget for ongoing legal consultation to proactively adapt operational procedures to evolving international and regional data protection regulations (e.g., GDPR, CCPA, PIPL).</p><h2 class='why-what'>Technical</h2><p>Implement strong <b>pseudonymization and anonymization techniques</b> for non-essential personal data to limit its sensitivity. Deploy robust <b>Role-Based Access Control (RBAC)</b> across all data repositories and enforce strict need-to-know policies, especially for cross-border data access and processing activities, ensuring sensitive attributes are masked wherever possible.</p>"        ,
        "3": "Data Classification and Inventory",
        "3-summary": "Systematic identification and tagging of all data assets by sensitivity and compliance needs.",
        "3-tier": "Foundation",
        "3-points": "3",
        "3-recommendation": "<h2 class='why-what'>Executive </h2><p>Mandate the creation of a definitive <b>Data Inventory Register</b> that logs all data assets, their precise location, their designated owner, and their classification level (e.g., public, internal, confidential, restricted). Hold data owners directly accountable for maintaining the accuracy and completeness of their data records, with executive sign-off required for classification changes.</p><h2 class='why-what'>Technical</h2><p>Deploy <b>Automated Data Discovery and Classification Tools</b> across all environments (on-premise, cloud, and endpoints) to continuously scan, tag, and enforce classification policies. Use these classification tags to automatically drive security protection controls, such as enforcing encryption, configuring firewall rules, and applying appropriate access restrictions.</p>"        ,
        "4": "Legal & Jurisdictional Control",
        "4-summary": "Ability to resist extra-territorial data requests and maintain control under home jurisdiction.",
        "4-tier": "Strategic",
        "4-points": "4",
        "4-recommendation": "<h2 class='why-what'>Executive </h2><p>Seek explicit legal guarantees and mandatory contractual clauses that define the <b>governing law and exclusive jurisdiction</b> for data access, legal disputes, and responding to data requests, particularly with non-domestic cloud providers. Maintain a high-priority risk register that documents potential conflicts between foreign legal frameworks (e.g., CLOUD Act) and domestic data protection laws.</p><h2 class='why-what'>Technical</h2><p>Implement <b>Technical Isolation Measures</b> like <b>External Key Management (EKM)</b>, where the root encryption keys are stored and controlled by a domestic entity separate from the primary cloud provider. This technical separation ensures data cannot be accessed, even under a foreign subpoena, without the organisation's explicit jurisdictional control and consent.</p>"        ,
        "5": "Cryptographic Key Management Control",
        "5-summary": "Ownership and exclusive control over all encryption keys for sensitive data, independent of vendors.",
        "5-tier": "Strategic",
        "5-points": "6",
        "5-recommendation": "<h2 class='why-what'>Executive </h2><p>Establish an overarching <b>internal Cryptographic Policy</b> mandating the use of approved, high-assurance algorithms and key lengths across the enterprise. Critically, require that the <b>Master Keys</b> for all sensitive data and critical workloads are generated and controlled exclusively by the organisation, thereby eliminating single points of cryptographic control by vendors.</p><h2 class='why-what'>Technical</h2><p>Deploy a <b>cloud-agnostic External Key Management (EKM) solution</b> Utilising dedicated Hardware Security Modules (HSMs) operated by the organisation or a highly vetted, locally-controlled third party. Implement strict key rotation schedules, detailed audit logs for all key access events, and strict separation of duties for key operators to prevent unauthorised key export.</p>"        ,
        "6": "Workload Data Protection & Privacy",
        "6-summary": "Mechanisms to protect data during processing within critical applications and workloads.",
        "6-tier": "Strategic",
        "6-points": "5",
        "6-recommendation": "<h2 class='why-what'>Executive </h2><p>Require development teams to adopt <b>Confidential Computing</b> standards for highly sensitive data processing environments, actively isolating data while it is in use. Mandate a full review of all application architectures to ensure sensitive data is never unnecessarily exposed, logged, or temporarily stored in unprotected environments during processing flows.</p><h2 class='why-what'>Technical</h2><p>Utilise <b>Trusted Execution Environments (TEEs)</b> and modern CPU capabilities to run code and process data in an isolated, encrypted enclave. This technical isolation protects the data from the underlying operating system, hypervisor, and cloud provider administrators. Furthermore, enforce <b>end-to-end encryption</b> throughout the entire workload lifecycle (at rest, in transit, and in use).</p>"        ,
        "7": "Data Flow and Transfer Auditing",
        "7-summary": "Real-time monitoring and immutable logging of all data flows, transfers, and access events.",
        "7-tier": "Advanced",
        "7-points": "7",
        "7-recommendation": "<h2 class='why-what'>Executive </h2><p>Mandate the implementation of <b>data flow mapping and visualisation tools</b> for all critical applications to provide an immediate, clear picture of where data travels and is stored. Require compliance teams to perform quarterly, unannounced audits on all data transfer logs and cross-border data sharing agreements against established organisational policy.</p><h2 class='why-what'>Technical</h2><p>Implement <b>Data Loss Prevention (DLP) tools</b> at all network egress points to monitor, alert, and block unauthorised data egress or suspicious transfer attempts. Use <b>network segmentation and micro-segmentation</b> principles to restrict data flows to only essential, approved paths and endpoints, strictly enforcing a Zero Trust architecture.</p>"        ,
        "8": "Data Access by Third Parties Policies",
        "8-summary": "Strict, audited, and revocable control over any third-party access to organisational data.",
        "8-tier": "Advanced",
        "8-points": "8",
        "8-recommendation": "<h2 class='why-what'>Executive </h2><p>Develop and strictly enforce a <b>Third-Party Data Access Policy</b> that defines clear, time-limited thresholds for what data can be accessed, by whom, and under what circumstances (e.g., maintenance, support, legal request). Require a comprehensive annual re-vetting of all vendors that retain privileged access to sensitive data or systems.</p><h2 class='why-what'>Technical</h2><p>Enforce <b>Just-in-Time (JIT) access</b> and <b>Ephemeral Credentials</b> for all third-party access, ensuring permissions automatically expire after a defined short period. Require all external administrative access to be channeled through a monitored and recorded <b>Jump Box</b> or privileged access management (PAM) solution to ensure full audibility of all vendor actions.</p>"
    },
    "Domain-2": {
        "overview": "Technical Sovereignty evaluates the degree of control an organisation maintains over the foundational components of its technology stack—from the underlying hardware and firmware to the application source code and runtime environments. High maturity in this domain signifies a deliberate reduction in reliance on proprietary interfaces and single-vendor ecosystems. The organisation actively manages vendor lock-in risk by prioritising portability and open standards, ensuring they possess the ability to rebuild or migrate their critical functions onto a different technology platform if necessary, mitigating risks posed by geopolitical shifts or vendor failures.",
        "qnum": "2",
        "title": "Technical Sovereignty",
        "1": "Technology Stack Ownership & Control",
        "1-summary": "Basic knowledge and documentation of the technology components currently in use.",
        "1-tier": "Foundation",
        "1-points": "1",
        "1-recommendation": "<h2 class='why-what'>Executive </h2><p>prioritise and mandate strategic investment in developing or acquiring <b>technology components that grant full stack transparency and control</b>, especially for critical infrastructure like databases, identity management, and application runtimes. Senior leaders should proactively evaluate the long-term strategic benefit of contributing to or adopting high-priority open-source software (OSS) over proprietary alternatives.</p><h2 class='why-what'>Technical</h2><p>Favor solutions that allow for <b>multi-vendor deployment (IaaS, PaaS)</b> and explicitly avoid deeply integrated proprietary services tied to a single vendor. Critically, maintain internal expertise capable of operating, modifying, and troubleshooting the core technology stack without relying solely on a single vendor's support engineers.</p>"        ,
        "2": "Vendor Lock-in Risk Mitigation",
        "2-summary": "Basic analysis of proprietary dependencies and initial efforts to diversify technology providers.",
        "2-tier": "Foundation",
        "2-points": "2",
        "2-recommendation": "<h2 class='why-what'>Executive </h2><p>Integrate <b>Vendor Lock-in Risk</b> as a formal and weighted criterion in all major technology procurement decisions, assigning a quantifiable risk score to potential contracts. Negotiate contracts that explicitly include favorable data portability clauses, defined and reasonable exit assistance services, and the right to use abstracted layers.</p><h2 class='why-what'>Technical</h2><p>Adopt <b>Abstracted Infrastructure Layers</b> (e.g., using Kubernetes for container orchestration or platform-agnostic APIs) and API-first designs to decouple applications from specific cloud platforms. Regularly perform <b>\"exit drills\" or proof-of-concept migrations</b> of non-critical workloads to alternative providers to maintain technical readiness and refine migration playbooks.</p>"        ,
        "3": "Standardised Technical Framework Adoption",
        "3-tier": "Foundation",
        "3-summary": "Use of widely accepted, non-proprietary industry standards for core technical components.",
        "3-points": "3",
        "3-recommendation": "<h2 class='why-what'>Executive </h2><p>Approve and mandate a set of <b>Standardised Technical Frameworks</b> (e.g., for APIs, authentication, networking, data formats) that align with global open industry standards and explicitly prohibit proprietary, vendor-specific integration paths. Compliance with this framework must be a mandatory prerequisite for all new technology projects.</p><h2 class='why-what'>Technical</h2><p>Utilise <b>Interoperability Standards</b> (e.g., OAuth 2.0, OpenID Connect) to ensure seamless communication and identity federation between services from different providers. Implement all infrastructure using <b>Infrastructure as Code (IaC)</b> templates based on provider-agnostic tools (like Terraform) to ensure environments can be consistently and quickly deployed elsewhere.</p>"        ,
        "4": "Interoperability and Portability Strategy",
        "4-summary": "A defined plan and architecture enabling easy migration between different technical environments.",
        "4-tier": "Strategic",
        "4-points": "4",
        "4-recommendation": "<h2 class='why-what'>Executive </h2><p>Develop a formal, documented <b>Portability Strategy</b> that clearly outlines the organisation's technical capability to move data, applications, and core processes between different operating environments (e.g., cloud-to-cloud, cloud-to-on-prem). Ensure the annual budget includes funds for maintaining multi-cloud compatibility layers and portability tooling.</p><h2 class='why-what'>Technical</h2><p>Containerize all new applications using <b>Docker and Kubernetes</b> to maximize portability across hosting environments. Ensure critical data formats are Standardised and non-proprietary (e.g., avoiding vendor-specific database features), and establish frequent, automated backup processes that allow data restoration and application restart on a technically different platform.</p>"        ,
        "5": "Hardware and Infrastructure Source Verification",
        "5-summary": "Verification and control over the origin and integrity of core computing hardware and firmware.",
        "5-tier": "Strategic",
        "5-points": "5",
        "5-recommendation": "<h2 class='why-what'>Executive </h2><p>Require and rigorously review <b>Source and Provenance Vetting</b> documentation for all critical hardware and infrastructure components (e.g., network gear, servers, specialized HSMs). Procurement must prioritise suppliers that provide full transparency regarding the manufacturing and supply chain origin, especially for components sourced from high-risk geopolitical regions.</p><h2 class='why-what'>Technical</h2><p>Implement <b>Trusted Platform Modules (TPMs)</b> and secure boot mechanisms to cryptographically verify hardware and firmware integrity at startup. Use digital signing and checksums to validate that all software and firmware updates originate from approved, verified sources within the supply chain before deployment.</p>"        ,
        "6": "Self-Hosted Application Runtime Control",
        "6-summary": "Hosting and control of application execution environments (runtime) on owned or controlled platforms.",
        "6-tier": "Strategic",
        "6-points": "6",
        "6-recommendation": "<h2 class='why-what'>Executive </h2><p>For mission-critical applications (e.g., core IP, regulatory compliance systems), mandate a <b>self-hosted or trusted sovereign-partner-hosted runtime model</b> to retain direct administrative control over the underlying operating system and application environment. Invest strategically in the tooling and personnel required to manage these environments effectively.</p><h2 class='why-what'>Technical</h2><p>Deploy application runtimes on <b>dedicated hardware or fully controlled Virtual Private Clouds (VPCs)</b> with minimal interaction from the hosting provider's control plane. Favor <b>open-source application servers and databases</b> to eliminate reliance on proprietary vendor-specific licenses and operational frameworks, thereby ensuring operational freedom.</p>"        ,
        "7": "Code and Intellectual Property Control",
        "7-summary": "Full control, ownership, and independent hosting of all critical application source code and IP.",
        "7-tier": "Advanced",
        "7-points": "7",
        "7-recommendation": "<h2 class='why-what'>Executive </h2><p>Establish clear, legally watertight <b>Intellectual Property (IP) ownership clauses</b> in all contracts with development vendors, contractors, and cloud providers, explicitly confirming organisational ownership of custom code and derived works. Implement a centralized, regularly audited IP registration and monitoring process.</p><h2 class='why-what'>Technical</h2><p>Implement <b>Source Code Version Control Systems (VCS)</b> that are either entirely self-hosted or provided by a highly vetted, local partner. Utilise mandatory <b>code escrow arrangements</b> for all outsourced application development, which guarantees access to the source code should the vendor fail or a dispute arise.</p>"        ,
        "8": "Future-Proofing Technology Roadmaps",
        "8-summary": "Strategic planning to ensure technological choices are resilient to geopolitical or vendor shifts.",
        "8-tier": "Advanced",
        "8-points": "8",
        "8-recommendation": "<h2 class='why-what'>Executive </h2><p>Develop a proactive <b>3-5 year technology roadmap</b> that explicitly identifies and tracks dependencies on external technologies, with a goal of replacing high-risk proprietary components with sovereign-compliant alternatives. Budget for <b>sunset clauses</b> and associated migration costs for legacy, non-compliant systems.</p><h2 class='why-what'>Technical</h2><p>Adopt a <b>'Next-Gen' Architecture Review Board</b> composed of senior engineers and architects to vet all new technology choices against the long-term sovereignty roadmap. prioritise technologies that are <b>platform-neutral</b> and benefit from robust, continuous community support to ensure longevity and avoid future forced upgrades.</p>"
    },
    "Domain-3": {
        "overview": "This domain examines the organisation's autonomy and independence in executing critical business and IT operations. It ensures that essential functions can be performed without reliance on external human expertise or infrastructure outside of the organisation's direct control or trusted sovereign borders. Key areas include internal skill development, resilience planning (e.g., Disaster Recovery that withstands geopolitical isolation), and transparent supply chain vetting. High maturity confirms that the organisation has robust, locally managed processes and personnel ready to maintain operations and execute incident response free from external interference.",
        "qnum": "3",
        "title": "Operational Sovereignty",
        "1": "Operational Process Documentation",
        "1-summary": "Documented procedures for routine and critical IT operations.",
        "1-tier": "Foundation",
        "1-points": "1",
        "1-recommendation": "<h2 class='why-what'>Executive </h2><p>Mandate that all critical operational procedures—including deployment, maintenance, and incident response—be fully documented, reviewed by internal subject matter experts, and updated quarterly. Crucially, ensure this documentation is stored in a <b>sovereign-controlled repository</b> separate from primary vendor infrastructure.</p><h2 class='why-what'>Technical</h2><p>Implement a centralized <b>Knowledge Management System (KMS)</b> linked to the Configuration Management Database (CMDB) to store and version-control all operational runbooks and procedures. Use automation tools (e.g., Ansible, Chef) that embed documentation directly within the Infrastructure-as-Code, ensuring a single source of truth for deployment and recovery.</p>"        ,
        "2": "Dependency on External Managed Services",
        "2-summary": "Identification of key external operational dependencies (e.g., outsourced functions and functions).",
        "2-tier": "Foundation",
        "2-points": "2",
        "2-recommendation": "<h2 class='why-what'>Executive </h2><p>Conduct a thorough <b>Managed Service Dependency Audit</b> to identify all third-party services that have persistent or privileged access to critical systems. Develop a strategic plan to either <b>insource</b> the management of high-risk functions or implement stringent technical controls to severely restrict vendor access and operational scope.</p><h2 class='why-what'>Technical</h2><p>Implement <b>\"break-glass\" procedures</b> for all critical managed services, allowing internal staff to take manual control and perform essential functions in an emergency without vendor intervention. Utilise <b>zero-trust network access (ZTNA)</b> principles to severely limit the external attack surface exposed by vendor connections.</p>"        ,
        "3": "Access Control and Identity Management",
        "3-summary": "Basic policies and systems to manage user access to resources.",
        "3-tier": "Foundation",
        "3-points": "3",
        "3-recommendation": "<h2 class='why-what'>Executive </h2><p>Establish a robust <b>Identity and Access Management (IAM) framework</b> with strict policies for privileged access and service accounts. Mandate mandatory, annual re-certification of all user and service accounts to ensure permissions are still necessary, appropriate, and strictly comply with the least-privilege principle.</p><h2 class='why-what'>Technical</h2><p>Implement mandatory <b>Multi-Factor Authentication (MFA)</b> for all internal and external access to sensitive data and systems. Enforce <b>Role-Based Access Control (RBAC)</b> across all cloud and on-premise resources, limiting permissions to the absolute minimum required for each specific role.</p>"        ,
        "4": "Internal Skills and Competency Development",
        "4-summary": "Active programs to build and retain in-house expertise for critical sovereign technologies.",
        "4-tier": "Strategic",
        "4-points": "4",
        "4-recommendation": "<h2 class='why-what'>Executive </h2><p>Develop a <b>Sovereignty Skills Development Plan</b> that identifies technical and operational competency gaps in managing self-hosted or sovereign-compliant technologies. Allocate dedicated and recurring funding for internal training, certification, and targeted recruitment in essential areas like open-source cloud, hardware maintenance, and key management.</p><h2 class='why-what'>Technical</h2><p>Establish an <b>internal Center of Excellence (CoE)</b> focused on sovereign technologies and best practices to drive knowledge sharing and mentorship. Implement a cross-training program to ensure technical staff are proficient on multiple infrastructure platforms, thereby reducing dependency on individual vendor expertise.</p>"        ,
        "5": "Disaster Recovery and Business Continuity",
        "5-summary": "Full, tested ability to recover and maintain operations without relying on foreign infrastructure.",
        "5-tier": "Strategic",
        "5-points": "5",
        "5-recommendation": "<h2 class='why-what'>Executive </h2><p>Mandate regular, realistic testing of the <b>Disaster Recovery (DR) and Business Continuity (BC)</b> plans, specifically simulating worst-case scenarios such as geopolitical isolation or a major vendor outage. The executive team must ensure the DR environment resides in a geographically and jurisdictionally separate, sovereign-compliant zone.</p><h2 class='why-what'>Technical</h2><p>Implement <b>immutable backups</b> that cannot be modified or deleted, even by system administrators, to protect against malicious encryption. Utilise a <b>cloud-agnostic data replication strategy</b> to maintain synchronized copies of critical data in a failover environment controlled exclusively by the organisation's domestic operations.</p>"        ,
        "6": "Supply Chain Transparency and Vetting",
        "6-summary": "Formal program to vet and monitor the security and geopolitical risk of all key technology suppliers.",
        "6-tier": "Strategic",
        "6-points": "6",
        "6-recommendation": "<h2 class='why-what'>Executive </h2><p>Establish a rigorous <b>Supply Chain Vetting Program</b> that requires critical vendors to disclose their sub-contractors and the geographic location of all support operations. Mandate contractual clauses granting the organisation the right to audit and inspect vendor security controls and data access policies.</p><h2 class='why-what'>Technical</h2><p>Use <b>Software Composition Analysis (SCA)</b> tools to continuously scan all third-party software components for known vulnerabilities and license compliance issues. Implement a strict <b>Secure Software Development Life Cycle (SSDLC)</b> that governs the integration and use of all external code libraries.</p>"        ,
        "7": "Sovereign Incident Response Plan",
        "7-summary": "A dedicated and tested incident response plan that limits external interference during crises.",
        "7-tier": "Advanced",
        "7-points": "7",
        "7-recommendation": "<h2 class='why-what'>Executive </h2><p>Develop a specialized <b>Sovereign Incident Response Plan</b> that details clear procedures for responding to a legal access request from a foreign government or a politically motivated cyberattack. This plan must include explicit steps for immediate engagement with domestic legal counsel and the designated national security authority.</p><h2 class='why-what'>Technical</h2><p>Ensure all security monitoring logs and evidence-gathering tools are <b>self-hosted and legally protected</b> within the sovereign jurisdiction. Implement automated data encryption and system lockdown capabilities that can be rapidly triggered in response to an identified external legal or coercive threat, limiting data availability.</p>"        ,
        "8": "Operational Autonomy in Critical Functions",
        "8-summary": "Ability to perform all critical business and technical operations entirely within controlled boundaries.",
        "8-tier": "Advanced",
        "8-points": "8",
        "8-recommendation": "<h2 class='why-what'>Executive </h2><p>Identify and formally list all <b>Critical Business Functions (CBFs)</b> and mandate a plan to achieve <b>Operational Autonomy</b> for each, ensuring they can operate for a defined period (e.g., 30 days) without external managed services or proprietary vendor inputs. This requires dedicated budget and executive oversight.</p><h2 class='why-what'>Technical</h2><p>Establish <b>Air-Gapped or Fully Isolated Network Segments</b> for hosting CBFs. Implement internal tooling and automation to manage and patch these environments independently, minimizing the need for external network connectivity or reliance on vendor-provided updates.</p>"
    },
    "Domain-4": {
        "overview": "Assurance Sovereignty addresses the right, capability, and transparency required to verify the security and compliance claims of both internal systems and external vendors. It's the mechanism by which trust is verified, not assumed. This domain covers control over all audit and security monitoring data, ensuring logs are retained locally for independent analysis. Advanced maturity means the organisation has contractual rights to mandate independent, sovereign-led inspections of provider environments and Utilises continuous technical validation to ensure that security controls remain effective against defined sovereign risks.",
        "qnum": "4",
        "title": "Assurance Sovereignty",
        "1": "Regular Security Audits Conducted",
        "1-summary": "Periodic internal or external assessments of security controls.",
        "1-tier": "Foundation",
        "1-points": "1",
        "1-recommendation": "<h2 class='why-what'>Executive </h2><p>Mandate that <b>Regular Security Audits</b> (including penetration testing and vulnerability scanning) be conducted by an <b>independent, sovereign-compliant third party</b> against a recognized international standard. The CISO must be required to report the audit results and subsequent remediation progress directly to the Board.</p><h2 class='why-what'>Technical</h2><p>Establish a comprehensive <b>Vulnerability Management Program</b> to track, prioritise, and manage the remediation lifecycle of all identified security gaps. Automate vulnerability scanning during the Continuous Integration/Continuous Delivery (CI/CD) pipeline to identify and fix code-level issues before deployment.</p>"        ,
        "2": "Control over Security Monitoring Data",
        "2-summary": "Logging and storage of basic security events and alerts.",
        "2-tier": "Foundation",
        "2-points": "2",
        "2-recommendation": "<h2 class='why-what'>Executive </h2><p>Enforce a strict policy that all <b>Security Monitoring Data</b> (raw logs, SIEM data, security alerts) for critical systems must be collected and stored immediately within a <b>sovereign-controlled repository</b>. Contractually prohibit external vendors from deleting, modifying, or exporting this data without explicit, documented internal authorization.</p><h2 class='why-what'>Technical</h2><p>Deploy a <b>Self-Hosted Security Information and Event Management (SIEM) solution</b> or a hybrid solution where raw logs for sensitive workloads are processed and stored locally. Implement strong encryption and immutable storage for all security logs to maintain their integrity and chain of custody for legal purposes.</p>"        ,
        "3": "Risk Management Framework",
        "3-summary": "A basic framework for identifying and assessing geopolitical and sovereignty-related risks.",
        "3-tier": "Foundation",
        "3-points": "3",
        "3-recommendation": "<h2 class='why-what'>Executive </h2><p>Adopt a formal, internationally recognized <b>Risk Management Framework</b> (e.g., NIST, ISO 31000) and formally integrate digital sovereignty risks (legal, geopolitical, vendor lock-in) into the core enterprise risk matrix. Mandate quarterly risk review meetings with senior leadership to address high-scoring sovereignty risks.</p><h2 class='why-what'>Technical</h2><p>Implement <b>Governance, Risk, and Compliance (GRC) tools</b> to automate the tracking of identified risks against policy controls and remediation efforts. Use the framework to drive the allocation of the security budget toward the highest-sovereignty-risk areas, ensuring investment aligns with strategic control objectives.</p>"        ,
        "4": "Compliance with Local Security Standards",
        "4-summary": "Certification against national or local industry-specific security and sovereign standards.",
        "4-tier": "Strategic",
        "4-points": "4",
        "4-recommendation": "<h2 class='why-what'>Executive </h2><p>Ensure the organisation's security policies are <b>explicitly mapped to and compliant with all local security standards</b> (e.g., national cyber security agency guidelines, mandated cloud security levels). Require annual third-party compliance verification against these local standards, going beyond basic international certifications.</p><h2 class='why-what'>Technical</h2><p>Utilise <b>Compliance-as-Code</b> tools (e.g., OpenSCAP, specialized cloud security posture management) to embed compliance requirements directly into infrastructure deployment configurations. Automate continuous monitoring of the environment against local security baselines, generating immediate alerts for any configuration drift.</p>"        ,
        "5": "Transparency in Vendor Security Practices",
        "5-summary": "Contractual obligation for vendors to provide detailed, auditable reports on their security posture.",
        "5-tier": "Strategic",
        "5-points": "5",
        "5-recommendation": "<h2 class='why-what'>Executive </h2><p>Require all major technology vendors to provide <b>documented transparency</b> regarding their internal security practices, including comprehensive audit reports (e.g., SOC 2, ISO 27001) and explicit details on how they handle external legal data access requests. Integrate a robust 'right to information' clause into all new contracts.</p><h2 class='why-what'>Technical</h2><p>Implement <b>Vendor Risk Management (VRM) solutions</b> to centralize, track, and score the security posture and transparency of all third-party providers. Focus the technical vetting process on the vendor's controls designed to resist non-sovereign legal access to customer data.</p>"        ,
        "6": "Independent Certification and Vetting",
        "6-summary": "The right and ability to mandate independent third-party audits of all critical vendors/platforms.",
        "6-tier": "Advanced",
        "6-points": "6",
        "6-recommendation": "<h2 class='why-what'>Executive </h2><p>Mandate that all critical third-party services and cloud environments hold <b>independent, sovereign-recognized security certifications</b> (e.g., specific national cloud security labels, high-level ISO certifications). prioritise partners that Utilise local, independent auditors whose jurisdiction aligns with the organisation's sovereignty requirements.</p><h2 class='why-what'>Technical</h2><p>Do not rely solely on vendor certifications; implement layered internal security controls (like encryption with self-managed keys and micro-segmentation) to provide an <b>additional layer of sovereign protection</b> independent of the provider’s certification scope.</p>"        ,
        "7": "Ability to Invoke Sovereign Inspections",
        "7-summary": "Contractual and legal rights to perform on-demand, deep technical inspections of provider platforms.",
        "7-tier": "Advanced",
        "7-points": "7",
        "7-recommendation": "<h2 class='why-what'>Executive </h2><p>Establish a formal process, vetted by legal and executive management, that details the procedures and legal grounds for the organisation to <b>invoke sovereign inspections</b> (audits, data access) over a critical vendor. Ensure explicit and legally sound clauses granting the right to inspect are included in every contract.</p><h2 class='why-what'>Technical</h2><p>Maintain <b>detailed audit trails and logging</b> of all administrative activity by the cloud vendor's personnel, allowing internal security teams to effectively perform a technical inspection when the sovereign right to inspect is invoked. Test the ability to access this data rapidly during DR drills.</p>"        ,
        "8": "Continuous Security Control Validation",
        "8-summary": "Automated, ongoing testing and validation of the effectiveness of security and sovereign controls.",
        "8-tier": "Advanced",
        "8-points": "8",
        "8-recommendation": "<h2 class='why-what'>Executive </h2><p>Implement a program for <b>Continuous Security Control Validation (CSCV)</b> to ensure that security measures are not only implemented but remain effective against current threats over time. Link CSCV results directly to the risk management framework to ensure high-risk control failures are immediately escalated to the executive level.</p><h2 class='why-what'>Technical</h2><p>Deploy <b>Breach and Attack Simulation (BAS)</b> tools to continuously test the efficacy of security controls against real-world threats. Use automated scanning tools to verify that security configurations (e.g., firewall rules, encryption settings) align with the documented sovereign policy baseline.</p>"
    },
    "Domain-5": {
        "overview": "This domain focuses on the strategic adoption and engagement with Open Source Software (OSS) as a tool for mitigating vendor dependency and strengthening technical control. Using OSS is a powerful way to eliminate proprietary lock-in, but maturity requires more than just consumption. A mature organisation actively assesses the stability and health of its OSS dependencies, develops internal expertise to audit and modify the code, and strategically contributes to critical projects. This engagement ensures the organisation has the necessary influence and a viable 'forking' contingency plan should a vital OSS project become unstable or commercially compromised.",
        "qnum": "5",
        "title": "Open Source",
        "1": "OSS Policy and Usage Guidelines",
        "1-summary": "Established rules for the procurement, use, and license compliance of Open Source Software.",
        "1-tier": "Foundation",
        "1-points": "1",
        "1-recommendation": "<h2 class='why-what'>Executive </h2><p>Develop and enforce a clear <b>Open Source Software (OSS) Policy</b> that defines approved components, acceptable licensing terms, and the mandatory process for conducting security and dependency risk reviews before deployment. Formally appoint a senior manager responsible for OSS governance.</p><h2 class='why-what'>Technical</h2><p>Utilise <b>Software Composition Analysis (SCA)</b> tools integrated into the CI/CD pipeline to maintain a comprehensive inventory of all OSS components used. These tools must track license compliance and continuously monitor for newly disclosed vulnerabilities in those components.</p>"        ,
        "2": "Internal OSS Skills and Expertise",
        "2-summary": "Basic internal training and awareness of Open Source technologies.",
        "2-tier": "Foundation",
        "2-points": "2",
        "2-recommendation": "<h2 class='why-what'>Executive </h2><p>Allocate resources for <b>Internal OSS Skills Development</b> through dedicated training, internal workshops, and time for engineers to work on upstream open-source projects. Recognize and reward engineers for contributing expertise to strategic OSS components, fostering internal ownership.</p><h2 class='why-what'>Technical</h2><p>Establish an internal <b>Code Review Board or Team</b> dedicated to understanding, customizing, and maintaining core OSS components. Encourage engineers to transition from being mere OSS consumers to being active contributors to critical projects to deepen internal knowledge.</p>"        ,
        "3": "Source Code Escrow Arrangements",
        "3-summary": "Legal agreements to hold critical proprietary source code in escrow.",
        "3-tier": "Foundation",
        "3-points": "3",
        "3-recommendation": "<h2 class='why-what'>Executive </h2><p>For all third-party proprietary software that is deemed critical and cannot be easily replaced, mandate a <b>Source Code Escrow Agreement</b> with a neutral third party. The contract must define clear release conditions based on vendor failure, acquisition, or legal/geopolitical events that compromise service delivery.</p><h2 class='why-what'>Technical</h2><p>Regularly <b>verify the integrity and buildability</b> of the code held in escrow to ensure that the source code is indeed usable and matches the deployed version of the application. This readiness check ensures the escrow serves as a viable continuity option.</p>"        ,
        "4": "Dependency Risk Assessment",
        "4-summary": "Formal process for analysing the security and stability risks of third-party OSS libraries used.",
        "4-tier": "Strategic",
        "4-points": "4",
        "4-recommendation": "<h2 class='why-what'>Executive </h2><p>Implement a formal <b>Dependency Risk Assessment</b> for all technology components (OSS, commercial, cloud services) focusing specifically on the <b>single point of failure risk</b> and the likelihood of geopolitical disruption to the source project or vendor. prioritise mitigation for components with a high-risk score.</p><h2 class='why-what'>Technical</h2><p>Utilise <b>Dependency Mapping tools</b> to visualise the supply chain of all software and infrastructure components. For high-risk components, establish a <b>dual-source strategy</b> where alternative technologies are identified and partially integrated to allow for rapid switching.</p>"        ,
        "5": "Forking Strategy for Critical OSS",
        "5-summary": "A prepared plan to take over and maintain critical OSS dependencies if the original project fails.",
        "5-tier": "Strategic",
        "5-points": "5",
        "5-recommendation": "<h2 class='why-what'>Executive </h2><p>Identify critical OSS components that are absolutely essential for operational autonomy and develop a detailed <b>Forking Strategy</b>. This strategy must define the executive triggers for an internal fork (e.g., loss of core maintainers, introduction of hostile code) and allocate guaranteed resources to maintain the independent code base.</p><h2 class='why-what'>Technical</h2><p>Maintain an <b>internal mirror repository</b> of the critical OSS codebase that includes all necessary build toolchains. Establish an automated patching and testing pipeline for the forked codebase to ensure the organisation can continue to deploy updates without relying on the upstream project.</p>"        ,
        "6": "Contribution to Strategic OSS Projects",
        "6-summary": "Active, strategic contribution of code and resources to OSS projects critical to the organisation.",
        "6-tier": "Advanced",
        "6-points": "6",
        "6-recommendation": "<h2 class='why-what'>Executive </h2><p>Allocate a portion of the development budget to <b>Contribute Code, Documentation, or Funding</b> to strategic OSS projects that underpin the organisation's sovereignty goals. This builds influence, ensures technology alignment, and strengthens the viability of the open ecosystem.</p><h2 class='why-what'>Technical</h2><p>Designate internal engineers to serve as <b>maintainers or core contributors</b> to key OSS projects. Establish a clear process for efficiently reviewing and submitting internal code improvements back to the upstream projects, maintaining strong community relations.</p>"        ,
        "7": "Active OSS Community Engagement",
        "7-summary": "Deep involvement in key Open Source communities to influence development direction.",
        "7-tier": "Advanced",
        "7-points": "7",
        "7-recommendation": "<h2 class='why-what'>Executive </h2><p>Sponsor or actively participate in <b>strategic OSS Community Engagement</b> by hosting events, joining governance boards, and collaborating with like-minded organisations. This ensures the organisation has a direct voice and early visibility into the direction of the ecosystems it relies upon.</p><h2 class='why-what'>Technical</h2><p>Encourage technical staff to be active in community forums, mailing lists, and special interest groups (SIGs) related to core OSS. Ensure the organisation is notified immediately of any major shifts in project governance, licensing, or personnel.</p>"        ,
        "8": "Ability to Influence OSS Roadmaps",
        "8-summary": "Strategic engagement with Open Source foundations to steer future software development.",
        "8-tier": "Advanced",
        "8-points": "8",
        "8-recommendation": "<h2 class='why-what'>Executive </h2><p>Develop a structured approach to <b>Influence OSS Roadmaps</b> by sponsoring new features, providing detailed use cases, and establishing contractual relationships with companies that are major contributors to relevant projects. Use financial backing to steer development toward sovereign-compatible features.</p><h2 class='why-what'>Technical</h2><p>Assign lead architects to develop and submit <b>formal proposals and Requests for Comments (RFCs)</b> to the OSS communities, guiding the evolution of the software to meet the organisation's long-term autonomy and feature requirements.</p>"
    },
    "Domain-6": {
        "qnum": "6",
        "overview": "Executive Oversight assesses the formal governance, sponsorship, and strategic integration of Digital Sovereignty principles across the entire organisation. This ensures that sovereignty is not just an IT concern, but a core business strategy driven from the top. Maturity is measured by the establishment of clear policies, dedicated budget allocation, and the creation of a formal Sovereignty Governance Board with decision-making authority. High maturity indicates that sovereignty metrics are defined as Key Performance Indicators (KPIs) and regularly reported to the executive board, fostering a pervasive organisational culture of sovereign awareness.",
        "title": "Executive Oversight",
        "1": "Designated Executive Sponsor ",
        "1-summary": "A senior executive has been officially assigned responsibility for Digital Sovereignty.",
        "1-tier": "Foundation",
        "1-points": "1",
        "1-recommendation": "<h2 class='why-what'>Executive </h2><p>Appoint a <b>Designated Executive Sponsor</b> (e.g., the COO, CIO, or a specific Board Member) to champion digital sovereignty initiatives. This sponsor must provide high-level visibility, clear organisational roadblocks, and ensure cross-departmental accountability. The role should be formally defined in the corporate governance charter.</p><h2 class='why-what'>Technical</h2><p>The Executive Sponsor should commit to <b>regular, dedicated meetings</b> with the technical and legal teams to fully understand implementation challenges, geopolitical risk exposure, and ensure the sovereignty technical roadmap is directly supported by executive decisions on resourcing and procurement.</p>"        ,
        "2": "Defined Digital Sovereignty Policy",
        "2-summary": "A written policy outlining the organisation's stance and requirements on digital sovereignty.",
        "2-tier": "Foundation",
        "2-points": "2",
        "2-recommendation": "<h2 class='why-what'>Executive </h2><p>Draft, approve, and publicly communicate a comprehensive <b>Defined Digital Sovereignty Policy</b> that clearly articulates the organisation's commitment to control over its data, technology, and operations. This policy must be ratified by the Board and serve as the foundational document for all subsequent IT, legal, and procurement decisions.</p><h2 class='why-what'>Technical</h2><p>The IT and Security teams must translate the high-level policy principles into <b>enforceable standards and controls</b> within the governance framework. Every new project initiation document (PID) should require a formal sign-off confirming alignment with the Sovereignty Policy before execution.</p>"        ,
        "3": "Budget Allocation for Sovereignty Initiatives",
        "3-summary": "Dedicated financial resources are allocated to implement sovereignty controls and programs.",
        "3-tier": "Foundation",
        "3-points": "3",
        "3-recommendation": "<h2 class='why-what'>Executive </h2><p>Allocate a <b>Dedicated Budget</b> line item specifically for Digital Sovereignty Initiatives (e.g., sovereign cloud migration, External Key Management deployment, talent development). This budget must be protected from discretionary cuts and its effectiveness measured based on quantified risk reduction achieved, not just cost savings.</p><h2 class='why-what'>Technical</h2><p>Use the dedicated budget to fund the premium costs often associated with highly sovereign infrastructure and services, recognizing that autonomy and control represent a <b>strategic value</b> that outweighs short-term cost savings on commodity global cloud resources.</p>"        ,
        "4": "Integration into Organisational Strategy",
        "4-summary": "Digital Sovereignty objectives are formally included in the overall business and technology strategy.",
        "4-tier": "Strategic",
        "4-points": "4",
        "4-recommendation": "<h2 class='why-what'>Executive </h2><p>Ensure Digital Sovereignty is formally <b>Integrated into the organisation's Overall Corporate Strategy</b>, sitting alongside core objectives like financial stability and market growth. The C-suite should communicate sovereignty not merely as a compliance burden, but as a source of <b>competitive advantage and enduring business resilience</b>.</p><h2 class='why-what'>Technical</h2><p>The enterprise architecture team must use the sovereignty strategy as a <b>core design constraint</b> for all major platform and application architecture decisions, favoring sovereign-compatible designs by default, and requiring justification for any non-sovereign choices.</p>"        ,
        "5": "Regular Reporting to the Board",
        "5-summary": "Consistent, periodic reporting of digital sovereignty risks and status to the executive board.",
        "5-tier": "Strategic",
        "5-points": "5",
        "5-recommendation": "<h2 class='why-what'>Executive </h2><p>Mandate <b>Regular Reporting to the Board</b> on the organisation's digital sovereignty maturity, Utilising the results of this assessment and defined KPIs. The report should focus on residual risk, critical dependencies, and strategic investment recommendations necessary to close identified control gaps.</p><h2 class='why-what'>Technical</h2><p>Provide the Board with clear, <b>non-technical visualisations</b> (e.g., heatmaps, spider charts) that accurately illustrate the progress made in the key pillars of data, technology, and operational sovereignty, ensuring technical complexity does not obscure strategic risk.</p>"        ,
        "6": "Sovereignty Culture and Awareness Program",
        "6-summary": "Ongoing training and communication ensure all staff understand their role in maintaining DS.",
        "6-tier": "Strategic",
        "6-points": "6",
        "6-recommendation": "<h2 class='why-what'>Executive </h2><p>Launch a formal <b>Sovereignty Culture and Awareness Program</b> across all departments (Legal, Procurement, IT, HR) to ensure a shared, universal understanding of digital risks and responsibilities. Procurement staff, in particular, must be rigorously trained on recognizing and negotiating sovereign-compliant contracting requirements.</p><h2 class='why-what'>Technical</h2><p>Integrate sovereignty principles into the <b>onboarding and annual compliance training</b> for all technical and administrative staff, highlighting their individual role in protecting data location, maintaining key control, and preventing unauthorised access.</p>"        ,
        "7": "Dedicated Sovereignty Governance Board",
        "7-summary": "A formal, cross-functional committee regularly monitors and directs sovereignty initiatives.",
        "7-tier": "Advanced",
        "7-points": "7",
        "7-recommendation": "<h2 class='why-what'>Executive </h2><p>Establish a <b>Dedicated Sovereignty Governance Board</b> composed of senior representatives from Legal, IT, Security, and Procurement. This board will be responsible for policy enforcement, budget oversight, and resolving high-level inter-departmental conflicts related to sovereignty implementation.</p><h2 class='why-what'>Technical</h2><p>The Governance Board must be empowered to enforce sovereign controls, even if they incur short-term performance or complexity costs, ensuring the strategic imperative is prioritised over minor operational inconveniences. They should approve all waivers for non-sovereign solutions.</p>"        ,
        "8": "Key Performance Indicators (KPIs) Defined",
        "8-summary": "Specific, measurable metrics are used to track and assess the success of sovereignty goals.",
        "8-tier": "Advanced",
        "8-points": "8",
        "8-recommendation": "<h2 class='why-what'>Executive </h2><p>Define clear, quantifiable <b>Key Performance Indicators (KPIs)</b> for digital sovereignty, such as 'Percentage of Critical Data under Sovereign Key Control' or 'Time to Recover Critical Functions in an Autonomy Event'. These KPIs should be tracked monthly and ideally linked to executive compensation.</p><h2 class='why-what'>Technical</h2><p>Implement <b>automated measurement tools</b> and dashboards to gather data for these KPIs directly from the technical environment (e.g., cloud API calls, EKM system logs), ensuring objective, consistent, and low-latency reporting on maturity progress.</p>"
    },
    "Domain-7": {
        "overview": "This technically focused domain scrutinises the specific control and configuration mechanisms within public and private cloud environments. As modern organisations rely heavily on cloud infrastructure, this domain ensures the organisation is sovereign within its rented space. It measures the ability to enforce strict local residency for resources and network traffic, manage encryption keys independently, and audit the provider's control plane activity. Achieving Advanced maturity means the organisation has a fully tested multi-cloud exit strategy, ensuring no single cloud vendor can hold critical workloads hostage.",
        "qnum": "7",
        "title": "Managed Services",
        "1": "Region and Zoning Control",
        "1-summary": "The ability to select and enforce specific sovereign physical regions and availability zones for all resources.",
        "1-tier": "Foundation",
        "1-points": "1",
        "1-recommendation": "<h2 class='why-what'>Executive </h2><p>Mandate <b>strict Region and Zoning Control</b> for all critical workloads. This requires contractual agreements with the provider that specify the exact geographic and availability zones for resource deployment and includes negotiating penalties for any unauthorised data or workload movement outside these zones.</p><h2 class='why-what'>Technical</h2><p>Utilise <b>cloud provider policies (e.g., organisation Policies, Service Control Policies)</b> to programmatically restrict the creation of resources to approved sovereign regions. Implement continuous auditing and alerting tools to flag any non-compliant resource creation immediately after it is attempted.</p>"        ,
        "2": "Sovereign Image and Container Registry",
        "2-summary": "Use of internal or locally hosted repositories for all virtual machine images and application containers.",
        "2-tier": "Foundation",
        "2-points": "2",
        "2-recommendation": "<h2 class='why-what'>Executive </h2><p>Establish a <b>Sovereign Image and Container Registry</b> hosted within the organisation's controlled jurisdiction (on-premise or a sovereign partner). Mandate that all production deployments must source their base images and application containers exclusively from this vetted, internal registry.</p><h2 class='why-what'>Technical</h2><p>Integrate <b>security scanning and vulnerability management</b> directly into the sovereign registry pipeline. Implement a formal process to pull, vet, and cryptographically sign all external images before they are placed in the sovereign registry for use by development teams.</p>"        ,
        "3": "Resource Dependency Mapping",
        "3-summary": "A clear inventory and mapping of all cloud resources and their specific dependencies on vendor-managed services.",
        "3-tier": "Foundation",
        "3-points": "3",
        "3-recommendation": "<h2 class='why-what'>Executive </h2><p>Conduct a comprehensive <b>Resource Dependency Mapping</b> exercise to identify all internal and external services required for critical application operation (e.g., DNS, CDN, logging). prioritise the replacement or isolation of non-sovereign dependencies that could lead to a single point of failure or foreign interference.</p><h2 class='why-what'>Technical</h2><p>Use <b>observability and tracing tools</b> to visualise application call graphs and dependency chains in real time. Model the impact of a failure or loss of control over each dependency to determine the required level of sovereign mitigation (e.g., replacing a vendor PaaS with an internal OSS solution).</p>"        ,
        "4": "Hyperscaler Data Access Vetting",
        "4-summary": "Formal review and control over the specific access rights of the Cloud Provider's technical staff to your environment.",
        "4-tier": "Strategic",
        "4-points": "4",
        "4-recommendation": "<h2 class='why-what'>Executive </h2><p>Develop a rigorous <b>Hyperscaler Data Access Vetting</b> protocol, requiring contractual assurance that cloud provider staff cannot access customer data except under defined, auditable, and customer-approved circumstances. Seek public documentation on the vendor's policy for resisting foreign legal access.</p><h2 class='why-what'>Technical</h2><p>Implement <b>Client-Side Encryption</b> and use <b>External Key Management (EKM)</b> to ensure that the hyperscaler's administrators technically cannot decrypt or access the customer's data, even if compelled by law. Utilise features like 'Customer Lockbox' for non-encrypted metadata access.</p>"        ,
        "5": "Network Egress/Ingress Path Control",
        "5-summary": "Ownership and enforcement of all network routing, ensuring data enters and leaves via sovereign gateways.",
        "5-tier": "Strategic",
        "5-points": "5",
        "5-recommendation": "<h2 class='why-what'>Executive </h2><p>Define a policy that mandates the implementation of <b>Network Egress/Ingress Path Control</b> to ensure all outbound and inbound traffic for critical data remains within the defined sovereign network boundaries. Review all network architecture diagrams for unmonitored external connections.</p><h2 class='why-what'>Technical</h2><p>Utilise <b>Network Virtual Appliances (NVAs)</b> and <b>Next-Generation Firewalls (NGFWs)</b> controlled by the organisation to strictly filter and monitor all external connections. Route all internet-bound traffic through a <b>sovereign-jurisdiction exit point</b> for full visibility and control before it hits the open internet.</p>"        ,
        "6": "Configuration-as-Code Ownership",
        "6-summary": "Exclusive control and independent hosting of all Infrastructure-as-Code (IaC) templates and configuration files.",
        "6-tier": "Strategic",
        "6-points": "6",
        "6-recommendation": "<h2 class='why-what'>Executive </h2><p>Establish an internal policy mandating <b>Configuration-as-Code (CaC) Ownership</b> by dedicated internal teams. This means all infrastructure definitions (Terraform, CloudFormation, Ansible) must be owned, versioned, and managed in an internal, sovereign-controlled Git repository.</p><h2 class='why-what'>Technical</h2><p>Implement <b>Guardrails and Automated Enforcement</b> to prevent manual configuration changes (Configuration Drift). The only path for infrastructure changes must be through the internal, auditable CaC pipeline, ensuring the organisation retains full control over the environment definition.</p>"       ,
        "7": "Control Plane Audit and Integrity",
        "7-summary": "Continuous, independent monitoring and verification of the cloud provider's underlying management plane integrity.",
        "7-tier": "Advanced",
        "7-points": "7",
        "7-recommendation": "<h2 class='why-what'>Executive </h2><p>Mandate independent, periodic <b>Control Plane Audit and Integrity</b> checks for the cloud environments, focusing on the configuration of core services (IAM, networking, key management). Ensure audit logs for control plane activities are retained in a sovereign location for forensic analysis.</p><h2 class='why-what'>Technical</h2><p>Configure <b>Cloud Auditing Services</b> (e.g., CloudTrail, Azure Activity Log) to continuously monitor the control plane for any changes or unusual activity. Use specialized tooling to look for patterns that might indicate unauthorised external access or provider misuse.</p>"        ,
        "8": "Multi-Cloud Exit Strategy Testing",
        "8-summary": "Regularly tested, automated mechanisms to quickly migrate critical workloads to a different cloud or on-premises environment.",
        "8-tier": "Advanced",
        "8-points": "8",
        "8-recommendation": "<h2 class='why-what'>Executive </h2><p>Develop and regularly <b>Test a Multi-Cloud Exit Strategy</b> that includes formal criteria for triggering a migration (e.g., major geopolitical event, vendor failure), a fully costed plan, and a dedicated executive team to manage the process.</p><h2 class='why-what'>Technical</h2><p>Perform <b>simulated migration exercises</b> on non-production environments annually. Maintain automated tools and playbooks that can efficiently package, transfer, and redeploy critical workloads and their data to an alternative sovereign-compliant target platform in a time-bound manner.</p>"
    }
}